yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151g3.h
#define EXTI_SR2_PBF             EXTI_SR2_bit.PBF
#define EXTI_SR2_PDF             EXTI_SR2_bit.PDF
#define EXTI_SR2_PEF             EXTI_SR2_bit.PEF
#define EXTI_SR2_PFF             EXTI_SR2_bit.PFF

#define EXTI_CONF1_PBLIS         EXTI_CONF1_bit.PBLIS
#define EXTI_CONF1_PBHIS         EXTI_CONF1_bit.PBHIS
#define EXTI_CONF1_PDLIS         EXTI_CONF1_bit.PDLIS
#define EXTI_CONF1_PDHIS         EXTI_CONF1_bit.PDHIS
#define EXTI_CONF1_PELIS         EXTI_CONF1_bit.PELIS
#define EXTI_CONF1_PEHIS         EXTI_CONF1_bit.PEHIS
#define EXTI_CONF1_PFLIS         EXTI_CONF1_bit.PFLIS
#define EXTI_CONF1_PFES          EXTI_CONF1_bit.PFES

#define EXTI_CR4_PGIS            EXTI_CR4_bit.PGIS
#define EXTI_CR4_PHIS            EXTI_CR4_bit.PHIS

#define EXTI_CONF2_PFHIS         EXTI_CONF2_bit.PFHIS
#define EXTI_CONF2_PGLIS         EXTI_CONF2_bit.PGLIS
#define EXTI_CONF2_PGHIS         EXTI_CONF2_bit.PGHIS
#define EXTI_CONF2_PHLIS         EXTI_CONF2_bit.PHLIS
#define EXTI_CONF2_PHHIS         EXTI_CONF2_bit.PHHIS
#define EXTI_CONF2_PGBS          EXTI_CONF2_bit.PGBS
#define EXTI_CONF2_PHDS          EXTI_CONF2_bit.PHDS

#endif

/*-------------------------------------------------------------------------
 *      ITC - EXTI bit masks
 *-----------------------------------------------------------------------*/
#define MASK_EXTI_CR1_P0IS       0x03
#define MASK_EXTI_CR1_P1IS       0x0C
#define MASK_EXTI_CR1_P2IS       0x30
#define MASK_EXTI_CR1_P3IS       0xC0

#define MASK_EXTI_CR2_P4IS       0x03
#define MASK_EXTI_CR2_P5IS       0x0C
#define MASK_EXTI_CR2_P6IS       0x30
#define MASK_EXTI_CR2_P7IS       0xC0

#define MASK_EXTI_CR3_PBIS       0x03
#define MASK_EXTI_CR3_PDIS       0x0C
#define MASK_EXTI_CR3_PEIS       0x30
#define MASK_EXTI_CR3_PFIS       0xC0

#define MASK_EXTI_SR1_P0F        0x01
#define MASK_EXTI_SR1_P1F        0x02
#define MASK_EXTI_SR1_P2F        0x04
#define MASK_EXTI_SR1_P3F        0x08
#define MASK_EXTI_SR1_P4F        0x10
#define MASK_EXTI_SR1_P5F        0x20
#define MASK_EXTI_SR1_P6F        0x40
#define MASK_EXTI_SR1_P7F        0x80

#define MASK_EXTI_SR2_PBF        0x01
#define MASK_EXTI_SR2_PDF        0x02
#define MASK_EXTI_SR2_PEF        0x04
#define MASK_EXTI_SR2_PFF        0x08

#define MASK_EXTI_CONF1_PBLIS    0x01
#define MASK_EXTI_CONF1_PBHIS    0x02
#define MASK_EXTI_CONF1_PDLIS    0x04
#define MASK_EXTI_CONF1_PDHIS    0x08
#define MASK_EXTI_CONF1_PELIS    0x10
#define MASK_EXTI_CONF1_PEHIS    0x20
#define MASK_EXTI_CONF1_PFLIS    0x40
#define MASK_EXTI_CONF1_PFES     0x80

#define MASK_EXTI_CR4_PGIS       0x03
#define MASK_EXTI_CR4_PHIS       0x0C

#define MASK_EXTI_CONF2_PFHIS    0x01
#define MASK_EXTI_CONF2_PGLIS    0x02
#define MASK_EXTI_CONF2_PGHIS    0x04
#define MASK_EXTI_CONF2_PHLIS    0x08
#define MASK_EXTI_CONF2_PHHIS    0x10
#define MASK_EXTI_CONF2_PGBS     0x20
#define MASK_EXTI_CONF2_PHDS     0x40


/*-------------------------------------------------------------------------
 *      WFE register definitions
 *-----------------------------------------------------------------------*/
/* WFE control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM2_EV0    : 1;
  unsigned char TIM2_EV1    : 1;
  unsigned char TIM1_EV0    : 1;
  unsigned char TIM1_EV1    : 1;
  unsigned char EXTI_EV0    : 1;
  unsigned char EXTI_EV1    : 1;
  unsigned char EXTI_EV2    : 1;
  unsigned char EXTI_EV3    : 1;
} __BITS_WFE_CR1;
#endif
__IO_REG8_BIT(WFE_CR1,     0x50A6, __READ_WRITE, __BITS_WFE_CR1);

/* WFE control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EXTI_EV4    : 1;
  unsigned char EXTI_EV5    : 1;
  unsigned char EXTI_EV6    : 1;
  unsigned char EXTI_EV7    : 1;
  unsigned char EXTI_EVB    : 1;
  unsigned char EXTI_EVD    : 1;
  unsigned char EXTI_EVF    : 1;
  unsigned char ADC1_COMP_EV: 1;
} __BITS_WFE_CR2;
#endif
__IO_REG8_BIT(WFE_CR2,     0x50A7, __READ_WRITE, __BITS_WFE_CR2);

/* WFE control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TIM3_EV0    : 1;
  unsigned char TIM3_EV1    : 1;
  unsigned char TIM4_EV     : 1;
  unsigned char SPI1_EV     : 1;
  unsigned char I2C1_EV     : 1;
  unsigned char USART1_EV   : 1;
  unsigned char DMA1CH01_EV : 1;
  unsigned char DMA1CH23_EV : 1;
} __BITS_WFE_CR3;
#endif
__IO_REG8_BIT(WFE_CR3,     0x50A8, __READ_WRITE, __BITS_WFE_CR3);

/* WFE control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RTC_CSSLSE_EV: 1;
  unsigned char SPI2_EV     : 1;
  unsigned char USART2_EV   : 1;
  unsigned char USART3_EV   : 1;
  unsigned char TIM5_EV0    : 1;
  unsigned char TIM5_EV1    : 1;
  unsigned char AES_EV      : 1;
} __BITS_WFE_CR4;
#endif
__IO_REG8_BIT(WFE_CR4,     0x50A9, __READ_WRITE, __BITS_WFE_CR4);


/*-------------------------------------------------------------------------
 *      WFE bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define WFE_CR1_TIM2_EV0         WFE_CR1_bit.TIM2_EV0
#define WFE_CR1_TIM2_EV1         WFE_CR1_bit.TIM2_EV1
#define WFE_CR1_TIM1_EV0         WFE_CR1_bit.TIM1_EV0
#define WFE_CR1_TIM1_EV1         WFE_CR1_bit.TIM1_EV1
#define WFE_CR1_EXTI_EV0         WFE_CR1_bit.EXTI_EV0
#define WFE_CR1_EXTI_EV1         WFE_CR1_bit.EXTI_EV1
#define WFE_CR1_EXTI_EV2         WFE_CR1_bit.EXTI_EV2
#define WFE_CR1_EXTI_EV3         WFE_CR1_bit.EXTI_EV3

#define WFE_CR2_EXTI_EV4         WFE_CR2_bit.EXTI_EV4
#define WFE_CR2_EXTI_EV5         WFE_CR2_bit.EXTI_EV5
#define WFE_CR2_EXTI_EV6         WFE_CR2_bit.EXTI_EV6
#define WFE_CR2_EXTI_EV7         WFE_CR2_bit.EXTI_EV7
#define WFE_CR2_EXTI_EVB         WFE_CR2_bit.EXTI_EVB
#define WFE_CR2_EXTI_EVD         WFE_CR2_bit.EXTI_EVD
#define WFE_CR2_EXTI_EVF         WFE_CR2_bit.EXTI_EVF
#define WFE_CR2_ADC1_COMP_EV     WFE_CR2_bit.ADC1_COMP_EV

#define WFE_CR3_TIM3_EV0         WFE_CR3_bit.TIM3_EV0
#define WFE_CR3_TIM3_EV1         WFE_CR3_bit.TIM3_EV1
#define WFE_CR3_TIM4_EV          WFE_CR3_bit.TIM4_EV
#define WFE_CR3_SPI1_EV          WFE_CR3_bit.SPI1_EV
#define WFE_CR3_I2C1_EV          WFE_CR3_bit.I2C1_EV
#define WFE_CR3_USART1_EV        WFE_CR3_bit.USART1_EV
#define WFE_CR3_DMA1CH01_EV      WFE_CR3_bit.DMA1CH01_EV
#define WFE_CR3_DMA1CH23_EV      WFE_CR3_bit.DMA1CH23_EV

#define WFE_CR4_RTC_CSSLSE_EV    WFE_CR4_bit.RTC_CSSLSE_EV
#define WFE_CR4_SPI2_EV          WFE_CR4_bit.SPI2_EV
#define WFE_CR4_USART2_EV        WFE_CR4_bit.USART2_EV
#define WFE_CR4_USART3_EV        WFE_CR4_bit.USART3_EV
#define WFE_CR4_TIM5_EV0         WFE_CR4_bit.TIM5_EV0
#define WFE_CR4_TIM5_EV1         WFE_CR4_bit.TIM5_EV1
#define WFE_CR4_AES_EV           WFE_CR4_bit.AES_EV

#endif

/*-------------------------------------------------------------------------
 *      WFE bit masks
 *-----------------------------------------------------------------------*/
#define MASK_WFE_CR1_TIM2_EV0    0x01
#define MASK_WFE_CR1_TIM2_EV1    0x02
#define MASK_WFE_CR1_TIM1_EV0    0x04
#define MASK_WFE_CR1_TIM1_EV1    0x08
#define MASK_WFE_CR1_EXTI_EV0    0x10
#define MASK_WFE_CR1_EXTI_EV1    0x20
#define MASK_WFE_CR1_EXTI_EV2    0x40
#define MASK_WFE_CR1_EXTI_EV3    0x80

#define MASK_WFE_CR2_EXTI_EV4    0x01
#define MASK_WFE_CR2_EXTI_EV5    0x02
#define MASK_WFE_CR2_EXTI_EV6    0x04
#define MASK_WFE_CR2_EXTI_EV7    0x08
#define MASK_WFE_CR2_EXTI_EVB    0x10
#define MASK_WFE_CR2_EXTI_EVD    0x20
#define MASK_WFE_CR2_EXTI_EVF    0x40
#define MASK_WFE_CR2_ADC1_COMP_EV 0x80

#define MASK_WFE_CR3_TIM3_EV0    0x01
#define MASK_WFE_CR3_TIM3_EV1    0x02
#define MASK_WFE_CR3_TIM4_EV     0x04
#define MASK_WFE_CR3_SPI1_EV     0x08
#define MASK_WFE_CR3_I2C1_EV     0x10
#define MASK_WFE_CR3_USART1_EV   0x20
#define MASK_WFE_CR3_DMA1CH01_EV 0x40
#define MASK_WFE_CR3_DMA1CH23_EV 0x80

#define MASK_WFE_CR4_RTC_CSSLSE_EV 0x01
#define MASK_WFE_CR4_SPI2_EV     0x02
#define MASK_WFE_CR4_USART2_EV   0x04
#define MASK_WFE_CR4_USART3_EV   0x08
#define MASK_WFE_CR4_TIM5_EV0    0x10
#define MASK_WFE_CR4_TIM5_EV1    0x20
#define MASK_WFE_CR4_AES_EV      0x40


/*-------------------------------------------------------------------------
 *      RST register definitions
 *-----------------------------------------------------------------------*/
/* Reset control register */
__IO_REG8    (RST_CR,      0x50B0, __READ_WRITE);
/* Reset status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PORF        : 1;
  unsigned char IWDGF       : 1;
  unsigned char ILLOPF      : 1;
  unsigned char SWIMF       : 1;
  unsigned char WWDGF       : 1;
  unsigned char BORF        : 1;
} __BITS_RST_SR;
#endif
__IO_REG8_BIT(RST_SR,      0x50B1, __READ_WRITE, __BITS_RST_SR);


/*-------------------------------------------------------------------------
 *      RST bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define RST_SR_PORF              RST_SR_bit.PORF
#define RST_SR_IWDGF             RST_SR_bit.IWDGF
#define RST_SR_ILLOPF            RST_SR_bit.ILLOPF
#define RST_SR_SWIMF             RST_SR_bit.SWIMF
#define RST_SR_WWDGF             RST_SR_bit.WWDGF
#define RST_SR_BORF              RST_SR_bit.BORF

#endif

/*-------------------------------------------------------------------------
 *      RST bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RST_SR_PORF         0x01
#define MASK_RST_SR_IWDGF        0x02
#define MASK_RST_SR_ILLOPF       0x04
#define MASK_RST_SR_SWIMF        0x08
#define MASK_RST_SR_WWDGF        0x10
#define MASK_RST_SR_BORF         0x20


/*-------------------------------------------------------------------------
 *      PWR register definitions
 *-----------------------------------------------------------------------*/
/* Power control and status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PVDE        : 1;
  unsigned char PLS         : 3;
  unsigned char PVDIEN      : 1;
  unsigned char PVDIF       : 1;
  unsigned char PVDOF       : 1;
} __BITS_PWR_CSR1;
#endif
__IO_REG8_BIT(PWR_CSR1,    0x50B2, __READ_WRITE, __BITS_PWR_CSR1);

/* Power control and status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VREFINTF    : 1;
  unsigned char ULP         : 1;
  unsigned char FWU         : 1;
} __BITS_PWR_CSR2;
#endif
__IO_REG8_BIT(PWR_CSR2,    0x50B3, __READ_WRITE, __BITS_PWR_CSR2);


/*-------------------------------------------------------------------------
 *      PWR bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

